# DataFrame에서 추출 ----------------------------------------------------

- 열(컬럼 column 세로벡터) 단위 데이터 추출
    - 방식 : DF객체변수명.[컬러명], DF객체변수명.컬럼명
    
- 행(로우 row 가로벡터) 단위 데이터 추출
    - 방식 : DF객체변수명, loc.[ 인덱스라벨 ], 또는 DF객체변수명, iloc.[ 정수인덱스 ]

- 원소 단위 데이터 추출
    - 방식 : DF객체변수명.loc[ 행인덱스라벨, 열인덱스라벨 ] 또는 [행인덱스라벨][열인덱스라벨]
             DF객체변수명.iloc[행인덱스, 열인덱스] 또는 [행인덱스][열인덱스]

In [1]:
# 모듈 로딩-------------------------------------------------------------------------------------
import pandas as pd

# 객체 생성 ------------------------------------------------------------------------------------
df = pd.DataFrame([[1,2,3], [11,22,33]])

In [2]:
df.info

<bound method DataFrame.info of     0   1   2
0   1   2   3
1  11  22  33>

In [3]:
df

    0   1   2
0   1   2   3
1  11  22  33

In [4]:
# 열(세로) 데이터 추출 ---------------------------------------------------
df[0]

0     1
1    11
Name: 0, dtype: int64

In [12]:
# DF 객체의 column 속성 변경
df.columns=['one','two','three']
df

   one  two  three
0    1    2      3
1   11   22     33

In [13]:
df.info

<bound method DataFrame.info of    one  two  three
0    1    2      3
1   11   22     33>

# 행(row, 가로) 데이터 추출 --------------------------------------------

- DF객체변수명.loc[], DF객체변수명.iloc[]

In [17]:
# 11, 22, 33 라인
df.iloc[1]                       # 행을 뽑을떈 반드시 iloc, loc

one      11
two      22
three    33
Name: 1, dtype: int64

In [19]:
oneRow = df.iloc[1]

print(f'{oneRow}, {type(oneRow)}')

one      11
two      22
three    33
Name: 1, dtype: int64, <class 'pandas.core.series.Series'>

In [21]:
twoRow=df.iloc[[0,1]]     # 2줄 이상 뽑고 싶을떄 리스트에 담아라!
twoRow

   one  two  three
0    1    2      3
1   11   22     33

In [22]:
twoRow=df.iloc[0,1]

print(f'twoRow => \n{twoRow}', f'twoRow Type => {type(twoRow)}',sep='\n')

twoRow =>
2
twoRow Type => <class 'numpy.int64'>

In [24]:
exam_data = {'수학':[90, 80, 70], '영어' : [98, 89, 95], '음악' : [85, 95, 100], '체육' : [100, 90, 90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 서준 to 인아
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 120.0+ bytes

In [26]:
# 우현학생의 성적만
oneRow = df.iloc[1]

수학    80
영어    89
음악    95
체육    90
Name: 우현, dtype: int64

In [28]:
oneRow = df.iloc[2]
oneRow

수학     70
영어     95
음악    100
체육     90
Name: 인아, dtype: int64

In [30]:
oneCol = df['음악']   # 컬럼 1개만 뽑을때는 df.음악 가능
oneCol

서준     85
우현     95
인아    100
Name: 음악, dtype: int64

In [32]:
# 우현 학생의 음악점수
df.iloc[1,2]

95

In [33]:
df.loc['혜진'] = [100, 100, 100, 100]

In [34]:
df

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   95  100   90
혜진  100  100  100  100

In [38]:
df.loc['호진'] = 100
df

     수학   영어   음악   체육
서준   90   98   85  100
우현   80   89   95   90
인아   70   95  100   90
혜진  100  100  100  100
호진  100  100  100  100

In [42]:
# 열 (컬럼 column) 추가하기 ----------------------------------------------------
df['국어'] = 200
df

     수학   영어   음악   체육   국어
서준   90   98   85  100  200
우현   80   89   95   90  200
인아   70   95  100   90  200
혜진  100  100  100  100  200
호진  100  100  100  100  200

# DF에서 행과 열 삭제하기 -----------------------------------------------------------------

- 삭제 관련 메서드 => drop()
   - 행 삭제 : DF객체변수명.drop(행 , axis=0) <= axis=() 행 기본값
   - 열 삭제 : DF객체변수명.drop(열 , axis=1)
    
인아 학생 성적 제거----------------------------

df.drop('인아', axis=0)

- drop() 특징
     - 실제 데이터 삭제하지 않음 => 복사본에서 데이터 삭제하고 복사본 반환

In [53]:
df2 = df.drop('서준', axis=0)
df2

     수학   영어   음악   체육   국어
우현   80   89   95   90  200
혜진  100  100  100  100  200
호진  100  100  100  100  200

In [54]:
df2.drop('수학', axis=1)

     영어   음악   체육   국어
우현   89   95   90  200
혜진  100  100  100  200
호진  100  100  100  200

In [58]:
df2

     영어   음악   체육   국어
우현   89   95   90  200
혜진  100  100  100  200
호진  100  100  100  200

# 행&열 전환 --------------------------------------------------------------

- 행 ==> 열 , 열 ==> 행으로 변환

- 방법

    - 메서드 : DF객체변수명.transpose()
    - 속 성 : DF객체변수명.T

In [59]:
# DF 객체의 형태 =. shape 속성
df2.shape

(3, 4)

In [63]:
df2 = df2.T

In [65]:
df2.transpose()

     우현   혜진   호진
영어   89  100  100
음악   95  100  100
체육   90  100  100
국어  200  200  200